
## Plan Result (image-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/63118)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ImageAPI-Prod:197" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ImageAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/imageapi-prod-app:e487a4ba6acdd440e3daad9173b6325f62b8d914" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/imageapi-prod-app:b8e5fbc514b5d690363f1d782053bbd2a08754a0"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ImageAPI-Prod" -> (known after apply)
      ~ revision                 = 197 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ImageAPI"
        }
        # (10 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"7b5e17ab-4406-40bd-996d-5f9f262283e5","JobName":"image-api_infrastructure_plan_prod","PRNumber":220,"Program":"tfcmt","SHA1":"b8e5fbc514b5d690363f1d782053bbd2a08754a0","Target":"image-api-cdk","Vars":{}} -->